# Desafio 3: Pandas (dataset Occupations)

### 1. Importar o pandas

In [2]:
import pandas as pd

### 2. Importar o dataset 'occupations.csv'

In [4]:
ocupacoes = pd.read_csv("occupations.csv")

### 3. Familiarize-se com o dataset, usando as funções pandas que já conhece

In [5]:
ocupacoes.head(10)

   age gender     occupation zip_code
0   24      M     technician    85711
1   53      F          other    94043
2   23      M         writer    32067
3   24      M     technician    43537
4   33      F          other    15213
5   42      M      executive    98101
6   57      M  administrator    91344
7   36      M  administrator    05201
8   29      M        student    01002
9   53      M         lawyer    90703

In [6]:
ocupacoes.tail(5)

     age gender     occupation zip_code
938   26      F        student    33319
939   32      M  administrator    02215
940   20      M        student    97229
941   48      F      librarian    78209
942   22      M        student    77841

In [7]:
ocupacoes.shape

(943, 4)

In [8]:
len(ocupacoes)

943

In [14]:
len(ocupacoes.columns)

4

### 4. Selecione os primeiros 25 registos (linhas)

In [15]:
ocupacoes.head(25)

    age gender     occupation zip_code
0    24      M     technician    85711
1    53      F          other    94043
2    23      M         writer    32067
3    24      M     technician    43537
4    33      F          other    15213
5    42      M      executive    98101
6    57      M  administrator    91344
7    36      M  administrator    05201
8    29      M        student    01002
9    53      M         lawyer    90703
10   39      F          other    30329
11   28      F          other    06405
12   47      M       educator    29206
13   45      M      scientist    55106
14   49      F       educator    97301
15   21      M  entertainment    10309
16   30      M     programmer    06355
17   35      F          other    37212
18   40      M      librarian    02138
19   42      F      homemaker    95660
20   26      M         writer    30068
21   25      M         writer    40206
22   30      F         artist    48197
23   21      F         artist    94533
24   39      M       engineer    55107

### 5. Selecione os últimos 10 registos

In [16]:
ocupacoes.tail(10)

     age gender     occupation zip_code
933   61      M       engineer    22902
934   42      M         doctor    66221
935   24      M          other    32789
936   48      M       educator    98072
937   38      F     technician    55038
938   26      F        student    33319
939   32      M  administrator    02215
940   20      M        student    97229
941   48      F      librarian    78209
942   22      M        student    77841

### 6. Escreva um comando que retorne uma tupla em que o primeiro elemento é o número de linhas do dataframe e o segundo elemento é o número de colunas

In [17]:
ocupacoes.shape

(943, 4)

### 7. Faça print do nome de todas as colunas

In [22]:
print(ocupacoes.columns)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### 8. Liste o tipo de cada coluna

In [23]:
ocupacoes.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 9. Faça print apenas da coluna "occupation"

In [26]:
print(ocupacoes["occupation"])

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### 10. Retorne quantas ocupações diferentes tem a coluna "occupation"

In [69]:
len(ocupacoes["occupation"].value_counts())

21

### 11. Retorne qual é a ocupação mais comum

In [30]:
ocupacoes["occupation"].mode()

0    student
Name: occupation, dtype: object

### 12. Sumarize todas as colunas do dataframe (numéricas e categóricas).
### Dica 1: use a função .describe() 
### Dica 2: a função .describe() por padrão mostra só as colunas numéricas

In [32]:
ocupacoes.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### 13. Sumarize apenas a coluna "occupation"

In [33]:
ocupacoes["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### 14. Retorne a idade média dos utilizadores

In [46]:
ocupacoes["age"].mean()

34.05196182396607

### 15. Retorne a idade menos comum no dataframe (idade com menos ocorrências)

In [67]:
ocupacoes["age"].value_counts().tail(1)

73    1
Name: age, dtype: int64